[
  {
    "role": "Founding Engineer",
    "employer": "Stealth Startup",
    "location": "Providence, Rhode Island",
    "description": "Building core infrastructure at an edtech startup that reaches 400,000+ monthly impressions."
  },
  {
    "role": "Undergraduate Teaching Assistant (x2)",
    "employer": "Brown University",
    "location": "Providence, Rhode Island",
    "description": "I currently TA Introduction to Systems (CS0330), taught in C. I am a previous TA for Introduction to Data Structures and Algorithms (CS0200), taught in Java and Python."
  },
  {
    "role": "Undergraduate Researcher",
    "employer": "Humans To Robots Lab",
    "location": "Providence, Rhode Island",
    "description": "I co-engineered Unity software for communicating and controlling SPOT robot arm motion intent through virtual reality headsets."
  },
  {
    "role": "Applications Intern",
    "employer": "Cox Enterprises",
    "location": "Atlanta, Georgia",
    "description": "Cox Enterprises is a global conglomerate generating over $20B per year in primarily the media, automobile services, and telecommunications industries. I developed a serverless full-stack web application for Cox employees to register as Red Cross Blood Donor using React and AWS, wrote python scripts to reverse-engineer 1000+ lost investments data into SQL scripts, and created a high-level architecture strategy for M&A integrations."
  },
  {
    "role": "Technical Project Lead",
    "employer": "Brown Consulting Club",
    "location": "Providence, Rhode Island",
    "description": "Throughout 3 semesters, I consulted for a Fortune 15 telecommunications client, a healthcare startup, and the Chicago Public Library system. I led a team of 5 to assess the business opportunity of open access networks across North America for a Fortune 15 client (confidential) through geospatial analysis with ArcGIS and Tableau, and developed pitch decks to prepare the healthcare startup for Series A funding, and built out 15+ data visualizations and multiple Tableau dashboards for Chicago Public Library System to showcase key metrics and various demographics data of its 2.8 million patrons across 81 branches."
  },
  {
    "role": "Summer Intern",
    "employer": "Treehouse Holdings",
    "location": "Atlanta, Georgia",
    "description": "Treehouse Holdings is a private equity firm investing in early-stage companies in the healthcare and technology industries. I conducted various market analyses and legislation trend identifications and app testing."
  }
]
